app/views/simulations/index.html.erb

  <div class="field">
    <%= button_to 'Run', run_sim(simulations_path, current_user.memberships.first.group.name), method: :get %>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = ? LIMIT 1  [["id", 2]]
SELECT  `memberships`.* FROM `memberships` WHERE `memberships`.`user_id` = 9  ORDER BY `memberships`.`id` ASC LIMIT 1