app/views/memberships/_form.html.erb

    <%= f.label :group_id %><br />
    <%= f.collection_select :group_id, Group.all, :id, :name, prompt: true %>
---
SELECT `groups`.* FROM `groups`