app/views/memberships/index.html.erb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = ? LIMIT 1  [["id", 1]]
---
            <td><%= membership.user.name %></td>
            <td><%= membership.group.name %></td>