app/views/memberships/show.html.erb

        <td><%= @membership.user.name %></td>
        <td><%= @membership.group.name %></td>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = ? LIMIT 1  [["id", 1]]