app/views/inputs/_form.html.erb

    <%= f.label :group_name, 'Group' %><br />
    <%= f.text_field :group_name, value: Group.find(@session_group.id).name, readonly: true  %>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

    <%= f.label :money_left, 'Budget' %><br />
    <% if Output.belongs_to_group(@session_group.name).exists? %>
---
SELECT  1 AS one FROM `outputs` WHERE `outputs`.`group_name` = 'Panthers' LIMIT 1
SELECT  `outputs`.* FROM `outputs` WHERE `outputs`.`group_name` = 'Kiwis'  ORDER BY `outputs`.`id` DESC LIMIT 1