app/views/inputs/_form.html.erb

    <%= f.label :group_name %><br />
    <%= f.text_field :group_name, disabled: true, placeholder: current_user.memberships.first.group.name %>
---
SELECT  `memberships`.* FROM `memberships` WHERE `memberships`.`user_id` = ?  ORDER BY `memberships`.`id` ASC LIMIT 1  [["user_id", 5]]
SELECT `groups`.* FROM `groups` INNER JOIN `memberships` ON `groups`.`id` = `memberships`.`group_id` WHERE `memberships`.`user_id` = 9