app/views/inputs/index.html.erb

            <td><%= link_to 'Show', input %></td>
            <% if Output.belongs_to_input(input.id).empty? %>
---
SELECT `inputs`.* FROM `inputs`