app/views/inputs/show.html.erb

          <td><%= @input.days %></td>
          <% if Output.belongs_to_input(@input.id).empty? %>
---
SELECT COUNT(*) FROM `outputs` WHERE `outputs`.`input_id` = 22