app/views/partials/_student_welcome.html.erb

SELECT  1 AS one FROM `memberships` WHERE `memberships`.`user_id` = 12 LIMIT 1
SELECT  `memberships`.* FROM `memberships` WHERE `memberships`.`user_id` = ?  ORDER BY `memberships`.`id` ASC LIMIT 1  [["user_id", 2]]
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---

<% if current_user.memberships.exists? %>
  You are a member of the group: <%= current_user.memberships.first.group.name %>!