app/views/groups/_form.html.erb

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 8 LIMIT 1
---
      <%= f.label :course_id %><br />
      <%= f.collection_select :course_id, Course.where(:id => @session_course.id), :id, "name_crn" %>