app/views/groups/index.html.erb


<% if current_user.memberships.present? %>
---
SELECT `memberships`.* FROM `memberships` WHERE `memberships`.`user_id` = 2

      <% @groups.each do |group| %>
        <% if current_user.groups.exists?(:id => group.id) %>
---
SELECT  1 AS one FROM `groups` INNER JOIN `memberships` ON `groups`.`id` = `memberships`.`group_id` WHERE `memberships`.`user_id` = 2 AND `groups`.`id` = 1 LIMIT 1
SELECT `groups`.* FROM `groups`

            <td>
              <% Course.all.each do |course| %>
---
SELECT `courses`.* FROM `courses`