app/views/groups/show.html.erb

          <td>
            <% Course.all.each do |course| %>
---
SELECT `courses`.* FROM `courses`

      <tbody>
        <% Input.belongs_to_group(@group.name).each do |input| %>
---
SELECT `inputs`.* FROM `inputs` WHERE `inputs`.`group_name` = 'Kiwis'

            <td><%= input.money_left %></td>
            <% if Output.belongs_to_input(input.id).empty? %>
---
SELECT COUNT(*) FROM `outputs` WHERE `outputs`.`input_id` = 1
SELECT `outputs`.* FROM `outputs` WHERE `outputs`.`input_id` = 1