app/views/courses/index.html.erb

SELECT `courses`.* FROM `courses`
---
  <h2 class = "main-heading">Your Courses</h2>
  <% if Course.by_teacher(current_user.email).present? %>