app/views/courses/show.html.erb

SELECT `groups`.* FROM `groups` WHERE `groups`.`course_id` = 8
---
              <td>
              	<% if User.in_a_course_group(@course.id).match(user.id).exists? %>

SELECT COUNT(*) FROM `memberships` WHERE `memberships`.`group_id` = 15
---
		        <td><%= group.name %></td>
		        <td><%= group.memberships.count %></td>