app/views/posts/show.html.haml

SELECT COUNT(*) FROM `comments` WHERE `comments`.`post_id` = 13
---
	%h3
		= @post.comments.count