app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
INSERT INTO `comments` (`content`, `post_id`, `user_id`, `created_at`, `updated_at`) VALUES ('What is this bs', 13, 9, '2016-04-15 13:28:12', '2016-04-15 13:28:12')

  def update
    if @comment.update(comment_params)
---
UPDATE `comments` SET `content` = 'It doens\'t quite work as I expected, does it', `updated_at` = '2016-04-15 14:27:33' WHERE `comments`.`id` = 14

  def destroy
    @comment.destroy
---
DELETE FROM `comments` WHERE `comments`.`id` = 1

    def set_post
      @post = Post.find(params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 13 LIMIT 1

    def set_comment
      @comment = @post.comments.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 13 AND `comments`.`id` = 14 LIMIT 1