app/controllers/enrollments_controller.rb

INSERT INTO `enrollments` (`user_id`, `course_id`, `created_at`, `updated_at`) VALUES (2, 8, '2016-04-16 18:39:59', '2016-04-16 18:39:59')
---
  def create
    @enrollment = Enrollment.new(enrollment_params)

    respond_to do |format|
      if @enrollment.save