app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES (?, ?, ?)  [["name", "Eagles"], ["created_at", "2016-03-16 23:44:05"], ["updated_at", "2016-03-16 23:44:05"]]