app/controllers/inputs_controller.rb

  def index
    @inputs = Input.all
---
SELECT `inputs`.* FROM `inputs`

  def create
    @input = Input.new(input_params)

    respond_to do |format|
      if @input.save
---
INSERT INTO `inputs` (`group_name`, `vaccines`, `school_off`, `days`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?)  [["group_name", "Lions"], ["vaccines", 50000], ["school_off", 0], ["days", 7], ["created_at", "2016-03-14 03:10:06"], ["updated_at", "2016-03-14 03:10:06"]]

  def update
    respond_to do |format|
      if @input.update(input_params)
---
UPDATE `inputs` SET `days` = ?, `updated_at` = ? WHERE `inputs`.`id` = ?  [["days", 3], ["updated_at", "2016-03-17 03:17:02"], ["id", 1]]

  def destroy
    @input.destroy
---
DELETE FROM `inputs` WHERE `inputs`.`id` = ?  [["id", 2]]

    def set_input
      @input = Input.find(params[:id])
---
SELECT  `inputs`.* FROM `inputs` WHERE `inputs`.`id` = ? LIMIT 1  [["id", 2]]