app/controllers/memberships_controller.rb

SELECT `memberships`.* FROM `memberships`
---
  def index
    @memberships = Membership.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 8 LIMIT 1
---
  def new
    @user_id = User.find(params[:user_id])
    @course_id = Course.find(params[:course_id])

INSERT INTO `memberships` (`user_id`, `group_id`, `created_at`, `updated_at`) VALUES (2, 15, '2016-04-16 18:40:24', '2016-04-16 18:40:24')
---
  def create
    @membership = Membership.new(membership_params)

    respond_to do |format|
      if @membership.save

SELECT  `memberships`.* FROM `memberships` WHERE `memberships`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_membership
      @membership = Membership.find(params[:id])