app/controllers/outputs_controller.rb

  def index
    # begin simulation
    run_sim
    # Start of data compilation
    get_session_input
    get_session_group
    group_name = @session_group.name
    inputID = @session_input.id
    @population = 0
    @sick = 0
    @immune = 0
    @budget_rem = 0
    @vaccines_rem = 0
    @budget_vaccs = 0
    @budget_ads = 0
    Output.belongs_to_input(inputID).each do |output|
      @population += output.population
      @sick += output.sick
      @immune += output.immune
      @vaccines_rem += output.vaccs_left
      @budget_vaccs += output.money_spent_vaccines
    end
    output = Output.belongs_to_input(inputID).last
    if output.present?
        @budget_rem = output.money_left
    end
    Input.belongs_to_group(group_name).each do |input|
---
SELECT  `outputs`.* FROM `outputs` WHERE `outputs`.`input_id` = 22  ORDER BY `outputs`.`id` DESC LIMIT 1
SELECT `inputs`.* FROM `inputs` WHERE `inputs`.`group_name` = 'Kiwis'