app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`  ORDER BY created_at DESC
---
	def index
		@posts = Post.all.order("created_at DESC")

UPDATE `posts` SET `content` = 'My first bombNow I\'m editing this stuff because I didn\'t write anything on it earlier. butt content', `updated_at` = '2016-04-08 22:03:45' WHERE `posts`.`id` = 1
---
	def update
		if @post.update(post_params)

INSERT INTO `posts` (`title`, `content`, `user_id`, `created_at`, `updated_at`) VALUES ('Is this real life? ', '', 9, '2016-04-05 00:38:58', '2016-04-05 00:38:58')
---
	def create
		@post = current_user.posts.build(post_params)

		if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 8 LIMIT 1
---
	def find_post
		@post = Post.find(params[:id])