app/controllers/simulations_controller.rb

SELECT `simulations`.* FROM `simulations`
---
  def index
    @simulations = Simulation.all

INSERT INTO `simulations` (`input`, `created_at`, `updated_at`) VALUES (?, ?, ?)  [["input", 5], ["created_at", "2016-02-22 05:07:39"], ["updated_at", "2016-02-22 05:07:39"]]
---
  def create
    @simulation = Simulation.new(simulation_params)

    respond_to do |format|
      if @simulation.save

UPDATE `simulations` SET `input` = ?, `updated_at` = ? WHERE `simulations`.`id` = ?  [["input", 17], ["updated_at", "2016-02-23 01:35:16"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @simulation.update(simulation_params)

SELECT  `simulations`.* FROM `simulations` WHERE `simulations`.`id` = ? LIMIT 1  [["id", 3]]
---
    def set_simulation
      @simulation = Simulation.find(params[:id])