app/views/outputs/index.html.erb

SELECT MAX(`outputs`.`day`) FROM `outputs` WHERE `outputs`.`group_name` = 'Kiwis'
SELECT `outputs`.* FROM `outputs`
---
<% groupName = @session_group.name %>
<% count = Output.num_uniq_days(groupName).size / 250 %>