app/views/outputs/index.html.erb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT  `memberships`.* FROM `memberships` WHERE `memberships`.`user_id` = 9  ORDER BY `memberships`.`id` ASC LIMIT 1
---
<% groupName = current_user.memberships.first.group.name %>